{
  "title": "AA 2025-2 U-III: EXAMEN Algoritmos para Grafos",
  "description": "Propiedades de DFS/BFS, algoritmos de árbol de expansión mínima (MST), aristas seguras, Bellman-Ford optimizado y fundamentos teóricos de rutas más cortas.",
  "max_time": 1800,
  "problemas": [
    {
      "id": 1,
      "enunciado": "Crear una tabla de 3x3 con renglones y columnas etiquetadas con los colores/tipos que toman los vértices durante la ejecución del DFS (White, Gray and Black). En cada casilla (i, j), indique si durante la ejecución de la DFS sobre un grafo dirigido puede existir una arista que vaya de un vértice del color i a un vértice del color j, en caso de sí poder existir indique el(los) tipo(s) de arista posibles."
    },
    {
      "id": 2,
      "enunciado": "Hacer lo mismo que en el ejercicio anterior, pero ahora parra la ejecución del BFS (White, Gray and Black)"
    },
    {
      "id": 3,
      "enunciado": "Para el algoritmo siguiente, que recibe como entrada un grafo conectado G y una función de costos reales w, demuestre que el árbol T resultante es un árbol de esparcimiento mínimo (MST) o proporcione un contraejemplo: \nMAYBE-MST-A (G, w) \n1. sort the edges into nonincreasing order of edge weights w \n2. T = E \n3. for each edge e, taken in nonincreasing order by weight \n4.       if T – {e} is a connected graph \n5.             T = T – {e} \n6. return T"
    },
    {
      "id": 4,
      "enunciado": "Para el algoritmo siguiente, que recibe como entrada un grafo conectado G y una función de costos reales w, demuestre que el árbol T resultante es un árbol de esparcimiento mínimo (MST) o proporcione un contraejemplo: \nMAYBE-MST-A (G, w) \n1. T = vacio \n2. for each edge e, taken in arbitrary order \n3.       if T ∪ {e} has no cycles \n4.             T = T ∪ {e} \n5. return T"
    },
    {
      "id": 5,
      "enunciado": "Define qué es una arista segura para un conjunto A de aristas en un grafo dirigido. Explica cómo se relaciona con la propiedad de corte y proporciona un ejemplo con sus conjuntos S y S̄."
    },
    {
      "id": 6,
      "enunciado": "Dado un grafo ponderado dirigido G = (V, E), con función de costos reales w sobre las aristas y que no contiene ciclos de costo negativo, sea m la cantidad máxima de aristas sobre todas rutas más cortas (con respecto al peso de las aristas) que van del vértice fuente s hacia cada vértice v perteneciente a V. Proporcione una modificación del algoritmo Bellman-Ford que itere solamente m+1 veces el ciclo principal (línea 2), sin necesidad de conocer de antemano el valor de m."
    },
    {
      "id": 7,
      "enunciado": "Demuestra que cualquier subruta de una ruta más corta también es la ruta más corta entre sus extremos. Usa razonamiento formal o una prueba por contradicción."
    }
  ]
}