{
  "title": "Unidad IV: Introducción a la Teoría de la Computación",
  "description": "Reflexión conceptual sobre las clases P, NP y NP-completo, las nociones de verificabilidad y reducibilidad polinomial, y la relación entre problemas tractables e intratables.",
  "max_time": 10800,
  "problemas": [
    {
      "id": 1,
      "enunciado": "Explica la diferencia entre las clases de problemas P, NP y NP-completo, proporcionando un ejemplo de cada una."
    },
    {
      "id": 2,
      "enunciado": "En el libro se mencionan tres pares de problemas donde uno pertenece a P y el otro es NP-completo: (1) Caminos más cortos vs. caminos simples más largos, (2) Ciclo de Euler vs. ciclo Hamiltoniano, (3) 2-CNF vs. 3-CNF satisfacibilidad. Elige uno de estos pares y describe por qué uno es resoluble en tiempo polinomial y el otro es NP-completo, argumentando qué característica 'pequeña' hace que el segundo sea mucho más difícil."
    },
    {
      "id": 3,
      "enunciado": "Describe qué es una reducción polinomial y cuál es su papel en la demostración de que un problema es NP-completo."
    },
    {
      "id": 4,
      "enunciado": "Menciona la diferencia entre un problema abstracto y un problema concreto, ejemplificando cómo un problema abstracto puede pasar a concreto mediante codificación binaria."
    },
    {
      "id": 5,
      "enunciado": "Considera un algoritmo cuya complejidad depende del valor de una entrada entera k y cuyo tiempo de ejecución es del orden de k: analiza cómo cambia su clasificación (polinomial o no polinomial) dependiendo de si k se representa en unario o en binario."
    },
    {
      "id": 6,
      "enunciado": "Detalla por qué el problema HAM-CYCLE (determinar si un grafo no dirigido contiene un ciclo hamiltoniano) pertenece a la clase NP-completo."
    },
    {
      "id": 7,
      "enunciado": "Considera los problemas PATH (existe un camino de longitud menor o igual que k entre dos vértices) y HAM-CYCLE (existe un ciclo que pasa por todos los vértices exactamente una vez): indica a que categoria (P, NP, NP-completo) pertenecen, justificando tu respuesta."
    },
    {
      "id": 8,
      "enunciado": "¿Qué significa que un problema L1 sea reducible en tiempo polinomial a otro problema L2 (notación L1 <=P L2), describiendo a detalle por qué este concepto es esencial para definir los problemas NP-completos."
    }
  ]
}